nc: 1  # number of classes
depth_multiple: 0.33
width_multiple: 0.50
max_channels: 1024

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 4, C2f, [128, True]]          # 2 tăng repeats từ 3 lên 4, bật shortcut
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 8, C2f, [256, True]]          # 4 tăng repeats từ 6 lên 8, bật shortcut
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 8, C2f, [512, True]]          # 6 tăng repeats từ 6 lên 8, bật shortcut
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 4, C2f, [1024, True]]         # 8 tăng repeats từ 3 lên 4, bật shortcut
  - [-1, 1, SPPF, [1024, 5]]           # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 10
  - [[-1, 6], 1, Concat, [1]]                      # 11
  - [-1, 4, C2f, [512, True]]                      # 12 tăng repeats từ 3 lên 4, bật shortcut

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 13
  - [[-1, 4], 1, Concat, [1]]                      # 14
  - [-1, 4, C2f, [256, True]]                      # 15 tăng repeats từ 3 lên 4, bật shortcut

  - [-1, 1, Conv, [256, 3, 2]]                     # 16
  - [[-1, 12], 1, Concat, [1]]                     # 17
  - [-1, 4, C2f, [512, True]]                      # 18 tăng repeats từ 3 lên 4, bật shortcut

  - [-1, 1, Conv, [512, 3, 2]]                     # 19
  - [[-1, 9], 1, Concat, [1]]                      # 20
  - [-1, 4, C2f, [1024, True]]                     # 21 tăng repeats từ 3 lên 4, bật shortcut

  - [[15, 18, 21], 1, Detect, [nc]]                # 22 Detect layers
