# Custom YOLOv8s configuration with modified blocks

nc: 1  # number of classes
depth_multiple: 0.33
width_multiple: 0.50
max_channels: 1024

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 3, C2f, [128, False]]         # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 6, C2f, [256, False]]         # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 6, C2f, [512, False]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 3, C2f, [1024, False]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 10
  - [[-1, 6], 1, Concat, [1]]                      # 11
  - [-1, 3, C2f, [512, False]]                     # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 13
  - [[-1, 4], 1, Concat, [1]]                      # 14
  - [-1, 3, C2f, [256, False]]                     # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                     # 16
  - [[-1, 12], 1, Concat, [1]]                     # 17
  - [-1, 3, C2f, [512, False]]                     # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                     # 19
  - [[-1, 9], 1, Concat, [1]]                      # 20
  - [-1, 3, C2f, [1024, False]]                    # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]                # 22 Detect layers
